import QtQuick 2.0

Item {
    width: 320
    height: 480

    Text {
        anchors.fill: parent
        wrapMode: Text.WrapAtWordBoundaryOrAnywhere
        font.family: "Arial"
        font.pixelSize: 20
        text: "هو أمّا حكومة القاذفات مكن, وفي تنفّس الشرقي لهيمنة أن. هو قام هزيمة وأزيز اندلاع, ومن أي وبداية الواقعة. و إخضاع الكونجرس الموسوعة حول, جُل و سابق للغزو،, به، الحرب كنقطة المارق تم. شدّت الشطر وحلفاؤها بـ أسر, هذه بمعارضة والديون باستخدام تم, بـ معاملة الجنوبي لها. وسفن لهذه الحزب قام ٣٠, من الحرة عشوائية فعل, غير ٣٠ أوسع علاقة إستمات."
    }
}
